#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```

stdout:
module.satire_bot.aws_iam_user.event_notifier: Refreshing state... [id=event-emitter]
module.satire_bot.aws_iam_role.assume_role: Refreshing state... [id=iam_for_lambda]
module.satire_bot.aws_iam_access_key.event_notifier: Refreshing state... [id=AKIAWE4GYV5JSGUH4E57]
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=dd7d7dee-674b-4701-b711-91270c700004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.aws_iam_role.assume_role has changed
  ~ resource "aws_iam_role" "assume_role" {
        id                    = "iam_for_lambda"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ]
        name                  = "iam_for_lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.satire_bot.aws_iam_user.event_notifier has changed
  ~ resource "aws_iam_user" "event_notifier" {
        id                   = "event-emitter"
        name                 = "event-emitter"
      + tags                 = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.satire_bot.aws_iam_role.assume_role will be updated in-place
  ~ resource "aws_iam_role" "assume_role" {
        id                    = "iam_for_lambda"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ]
        name                  = "iam_for_lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.satire_bot.aws_iam_user_policy.event_notifier will be created
  + resource "aws_iam_user_policy" "event_notifier" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + user   = "event-emitter"
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["ping_pong"] will be created
  + resource "aws_lambda_function" "satire_lambdas" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../bazel-bin/satire-bot/ping_pong.zip"
      + function_name                  = "ping_pong"
      + handler                        = "ping_pong"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::422800043859:role/iam_for_lambda"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "rpyR7mW1abeZ89jSOvnZNFWxnLpuhuOg1x46aNNjbOE="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SATBOT_DISCORD_TOKEN" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["pong_ping"] will be created
  + resource "aws_lambda_function" "satire_lambdas" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../bazel-bin/satire-bot/pong_ping.zip"
      + function_name                  = "pong_ping"
      + handler                        = "pong_ping"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::422800043859:role/iam_for_lambda"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "B6slUSML4tIrwYHUvu4wr9LpoHF7M/XiZ4BTtEWpv+E="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SATBOT_DISCORD_TOKEN" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.satire_bot.heroku_app.satire_bot will be updated in-place
  ~ resource "heroku_app" "satire_bot" {
        id                    = "dd7d7dee-674b-4701-b711-91270c700004"
        name                  = "satire-bot"
      ~ sensitive_config_vars = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.satire_bot.heroku_build.satire_bot will be created
  + resource "heroku_build" "satire_bot" {
      + app_id            = "dd7d7dee-674b-4701-b711-91270c700004"
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = "SHA256:0ad1df8af3104eba4ff0f52a3530d34b3080950af74a478a7802ee8b07bfa77c"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "../satire-bot/iac/.."
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

stderr:

```

</details>